<template>
    <div class="about-us container my-4">
      <h1 class="text-center mb-4">О нас</h1>
      <p>
        <strong>CryptoItshka</strong> — это инновационная платформа распространения новостей о блокчейне, криптовалютах и IT-технологиях со всего мира. Мы специализируемся на предоставлении актуальной и качественной информации и контента.
      </p>
      <p>
        Наша цель — быть надежным источником информации для всех, кто интересуется криптовалютами и технологиями. Мы стремимся поддерживать наших пользователей в курсе последних событий и трендов в мире крипто.
      </p>
      <p>
        <strong>CryptoItshka</strong> — это не просто платформа, а полноценный сайт крипто новостей, где каждый найдет для себя полезную информацию, аналитические статьи и экспертные мнения.
      </p>
      <!-- <p>
        Наши технологии позволяют автоматизировать сбор и обработку данных, предоставляя нашим читателям только самое важное и интересное. Мы постоянно работаем над улучшением нашего сервиса и рады делиться своими знаниями и опытом.
      </p> -->
      <p>
        Благодарим вас за доверие и выбор <strong>CryptoItshka</strong> в качестве вашего источника крипто новостей.
      </p>
    </div>
  </template>
  
  <script>
  export default {
    name: "AboutUs",
  };
  </script>
  
  <style scoped>
  .about-us {
    background-color: #f8f9fa;
    padding: 30px;
    border-radius: 8px;
    box-shadow: 0 4px 8px rgba(0, 0, 0, 0.1);
  }
  
  h1 {
    color: #333;
    margin-bottom: 20px;
  }
  
  p {
    line-height: 1.8;
    color: #555;
  }
  
  strong {
    color: #007bff;
  }
  </style>
  