<template>
    <div class="privacy-policy container my-4">
      <h1 class="text-center mb-4">Политика конфиденциальности</h1>
      <p>
        Ваша конфиденциальность важна для нас. В этой Политике конфиденциальности описывается, как мы собираем, используем, храним и защищаем ваши личные данные, а также ваши права и возможности по их управлению.
      </p>
  
      <h2>1. Сбор информации</h2>
      <p>
        Мы собираем информацию о вас, когда вы взаимодействуете с нашим сайтом. Это может включать следующие данные:
      </p>
      <ul>
        <li>Информацию, которую вы предоставляете при заполнении форм на сайте, включая имя, адрес электронной почты и номер телефона.</li>
        <li>Данные о вашем использовании нашего сайта, такие как IP-адрес, тип браузера, время посещения и страницы, которые вы просматриваете.</li>
        <li>Информацию, которую вы предоставляете нам при общении через поддержку или другие каналы связи.</li>
      </ul>
  
      <h2>2. Использование информации</h2>
      <p>
        Мы используем собранную информацию для различных целей, включая:
      </p>
      <ul>
        <li>Предоставление и улучшение наших услуг.</li>
        <li>Обеспечение безопасности и предотвращение мошенничества.</li>
        <li>Персонализация вашего опыта на сайте.</li>
        <li>Связь с вами по вопросам, связанным с услугами, включая ответы на запросы и уведомления.</li>
        <li>Соблюдение законов и нормативных требований.</li>
      </ul>
  
      <h2>3. Передача данных третьим лицам</h2>
      <p>
        Мы можем делиться вашими данными с третьими лицами в следующих случаях:
      </p>
      <ul>
        <li>С вашего согласия или по вашему запросу.</li>
        <li>Для выполнения наших юридических обязательств или защиты наших прав и интересов.</li>
        <li>С поставщиками услуг, которые помогают нам в работе нашего сайта и предоставлении услуг.</li>
        <li>В случае слияния, продажи или реорганизации компании, ваши данные могут быть переданы новому владельцу.</li>
      </ul>
  
      <h2>4. Хранение данных</h2>
      <p>
        Мы храним ваши личные данные в течение времени, необходимого для выполнения целей, описанных в этой Политике конфиденциальности, за исключением случаев, когда требуется или разрешено более длительное хранение в соответствии с законом.
      </p>
  
      <h2>5. Защита данных</h2>
      <p>
        Мы принимаем соответствующие меры безопасности для защиты ваших данных от несанкционированного доступа, использования или раскрытия. Это включает использование шифрования, защитных межсетевых экранов и других технологий.
      </p>
  
      <h2>6. Ваши права</h2>
      <p>
        Вы имеете право:
      </p>
      <ul>
        <li>Запрашивать доступ к своим данным и получать их копию.</li>
        <li>Исправлять свои данные, если они неточны или неполны.</li>
        <li>Удалять свои данные, если они больше не нужны для целей, для которых они были собраны.</li>
        <li>Ограничивать обработку своих данных при определенных обстоятельствах.</li>
        <li>Возражать против обработки своих данных для прямого маркетинга или на основании наших законных интересов.</li>
      </ul>
  
      <h2>7. Файлы cookie</h2>
      <p>
        Мы используем файлы cookie и аналогичные технологии для улучшения вашего опыта на нашем сайте. Файлы cookie помогают нам анализировать использование сайта, предоставлять персонализированный контент и рекламу, а также обеспечивать безопасность.
      </p>
  
      <h2>8. Ссылки на сторонние сайты</h2>
      <p>
        Наш сайт может содержать ссылки на другие сайты. Мы не несем ответственности за политику конфиденциальности или содержание этих сайтов. Мы рекомендуем вам ознакомиться с политиками конфиденциальности всех посещаемых вами сайтов.
      </p>
  
      <h2>9. Обновления политики</h2>
      <p>
        Мы можем обновлять эту Политику конфиденциальности для отражения изменений в нашей практике или законодательства. Все изменения будут опубликованы на этой странице. Пожалуйста, регулярно проверяйте эту страницу для получения актуальной информации.
      </p>
  
      <h2>10. Контактная информация</h2>
      <p>
        Если у вас есть вопросы или комментарии по поводу этой Политики конфиденциальности, свяжитесь с нами по адресу: <a href="mailto:cryptoItshka.com">cryptoItshka.com</a>.
      </p>
    </div>
  </template>
  
  <script>
  export default {
    name: "privacy",
  };
  </script>
  
  <style scoped>
  .privacy-policy {
    background-color: #f8f9fa;
    padding: 30px;
    border-radius: 8px;
    box-shadow: 0 4px 8px rgba(0, 0, 0, 0.1);
  }
  
  h1, h2 {
    color: #333;
    margin-bottom: 20px;
  }
  
  p, ul {
    line-height: 1.8;
    color: #555;
  }
  
  a {
    color: #007bff;
    text-decoration: none;
  }
  
  a:hover {
    text-decoration: underline;
  }
  </style>
  